Catalogs/упПравилаРежимаТрудаИОтдыхаСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упПравилаРежимаТрудаИОтдыхаСотрудников</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВестиСуммированныйУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродолжительностьРабочегоВремениДеньЧ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродолжительностьРабочегоВремениОднаНеделяЧ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродолжительностьРабочегоВремениДвеНеделиЧ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециальныйПерерывПервыйПродолжительностьМ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециальныйПерерывПервыйПериодичностьЧ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециальныйПерерывПоследующиеПродолжительностьМ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециальныйПерерывПоследующиеПериодичностьЧ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерерывОбедОтдыхКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерерывОбедОтдыхПродолжительностьМ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерерывОбедОтдыхПериодичностьЧ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НесколькоВодителей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/упПравилаРежимаТрудаИОтдыхаСотрудников/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если упСервисныеФункции.ЭтоВызовПослеОткрытияФормы(ЭтаФорма) Тогда
		ПриСозданииПриЧтенииНаСервере();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере()
	упСервисныеФункцииКлиентСервер.УстановитьКартинкуКомментария(Элементы.ГруппаДополнительно, Объект.Комментарий);	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПриСозданииПриЧтенииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступность()
	УстановитьДоступностьСуммированныйУчет();
	УстановитьДоступностьНесколькоВодителей();
КонецПроцедуры
	
&НаКлиенте
Процедура УстановитьДоступностьСуммированныйУчет()
	//Элементы.ПродолжительностьРабочегоВремениОднаНеделя.Доступность = Объект.ВестиСуммированныйУчет;
	Элементы.ПродолжительностьРабочегоВремениДвеНедели.Доступность 	= Объект.ВестиСуммированныйУчет;
КонецПроцедуры

Процедура УстановитьДоступностьНесколькоВодителей()
	//Элементы.ПродолжительностьРабочегоВремениДень.Доступность = НЕ Объект.НесколькоВодителей;
	//Элементы.ПерерывОбедОтдыхКоличество.Доступность = НЕ Объект.НесколькоВодителей;
КонецПроцедуры

&НаКлиенте
Функция РассчитатьКоличествоОбеденныхПерерывов()
	
	ДлительностьДня 	= Объект.ПродолжительностьРабочегоВремениДеньЧ*60;
	ПериодичностьОбед 	= Объект.ПерерывОбедОтдыхПериодичностьЧ*60;
	ДлительностьОбед 	= Объект.ПерерывОбедОтдыхПродолжительностьМ;
	НовыйОбед = ПериодичностьОбед;
	
	нКоличество = 0;
	
	Для нСчетчик = 1 По ДлительностьДня Цикл
		Если нСчетчик = НовыйОбед Тогда
			нКоличество = нКоличество + 1;
			НовыйОбед = (НовыйОбед+ДлительностьОбед) + ПериодичностьОбед;
		КонецЕсли;
	КонецЦикла;
	
	Возврат нКоличество;
	
КонецФункции

#КонецОбласти

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ВестиСуммированныйУчетПриИзменении(Элемент)
	Если НЕ Объект.ВестиСуммированныйУчет Тогда
		Объект.ПродолжительностьРабочегоВремениОднаНеделяЧ 	= 0;
		Объект.ПродолжительностьРабочегоВремениДвеНеделиЧ 	= 0;
	КонецЕсли;
	УстановитьДоступностьСуммированныйУчет();
КонецПроцедуры

&НаКлиенте
Процедура НесколькоВодителейПриИзменении(Элемент)
	Если Объект.НесколькоВодителей Тогда
		Объект.ПродолжительностьРабочегоВремениДеньЧ = 24;
		Объект.ПерерывОбедОтдыхКоличество = РассчитатьКоличествоОбеденныхПерерывов();
	КонецЕсли;
	УстановитьДоступностьНесколькоВодителей();
КонецПроцедуры

&НаКлиенте
Процедура ПерерывОбедОтдыхПериодичностьПриИзменении(Элемент)
	Если Объект.НесколькоВодителей Тогда
		Объект.ПерерывОбедОтдыхКоличество = РассчитатьКоличествоОбеденныхПерерывов();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	упСервисныеФункцииКлиентСервер.УстановитьКартинкуКомментария(Элементы.ГруппаДополнительно, Объект.Комментарий);
КонецПроцедуры

#КонецОбласти
